In [2]:
import pandas as pd
import numpy as np

In [3]:
df_sat = pd.read_csv("../data/sat_2019_ca.csv")
print(df_sat.shape)
df_sat['CCode'].sort_values() #2018-2019
#df_sat.head() #2018-2019

(2580, 26)

2036     0.0
1535     1.0
98       1.0
515      1.0
1404     1.0
        ...
2022    58.0
2479    58.0
1090    58.0
888     58.0
2579     NaN
Name: CCode, Length: 2580, dtype: float64

In [4]:
df_act = pd.read_csv("../data/act_2019_ca.csv")
print(df_act.shape)
df_act['CCode'].sort_values() #2018-2019
#df_act.head() #2018-2019

(2310, 18)

2070     0.0
1809     1.0
578      1.0
599      1.0
619      1.0
        ...
957     58.0
2268    58.0
1642    58.0
1643    58.0
2309     NaN
Name: CCode, Length: 2310, dtype: float64

In [5]:
df_ada1 = pd.read_csv("../data/sht1_ca_ada_currentexpense1819.csv")
df_ada1.head()

,CO Code,District Code,District,EDP 365,Current\nExpense ADA,Current\nExpense Per ADA,LEA Type
0,1,61119,Alameda Unified,"117,225,882.50","8,968.85","13,070.34",Unified
1,1,61127,Albany City Unified,"46,611,059.59","3,544.52","13,150.18",Unified
2,1,61143,Berkeley Unified,"159,457,818.49","9,356.44","17,042.57",Unified
3,1,61150,Castro Valley Unified,"102,239,937.34","8,940.20","11,435.98",Unified
4,1,61168,Emery Unified,"12,504,023.21",681.82,"18,339.19",Unified

In [7]:
df_ada2 = pd.read_csv("../data/sht2_ca_ada_currentexpense1819.csv")
df_ada2.head()

      County           EDP 365 Current Expense\nADA Current\nExpense Per\nADA
0    Alameda  2,545,839,027.30           192,941.20                 13,194.90
1     Alpine      3,202,880.16                74.47                 43,009.00
2     Amador     36,092,488.90             3,775.31                  9,560.14
3      Butte    322,995,666.90            25,905.57                 12,468.19
4  Calaveras     59,126,582.49             4,515.02                 13,095.53

In [6]:
# Merge on CName? or CCode?  CCode range is 1:58 on all